artillery-config-test.yaml
config:
  target: 'http://localhost:3000'
  processor: './artillery-processor.cjs'

  phases:
  - duration: 60
    arrivalRate: 5
    rampTo: 50
    name: 'Low traffic'
  - duration: 60
    arrivalRate: 10
    rampTo: 50
    name: 'High traffic'
  - duration: 300
    arrivalRate: 50
    name: 'Sustained high traffic'

scenarios:
  - name: 'Get page of questions'
    flow:
      #  - loop:
      - get:
          url: '/qa/questions?product_id=45006'